RuanJG/stm32App/source/app/app_motor.c
#include "main_config.h"
#include "bsp.h"
#include "stm32f10x.h"
#include "uart.h"
#include "protocol.h"
#include "systick.h"
#include "iap.h"
#include "pwm.h"
#include "LCD1602.h"
#include "hw_config.h"
#include "switcher.h"
#if BOARD_MOTOR


#define _LOG(X...) if( 1 ) printf(X);



volatile char current_point = 0 ; // 0 motor1 round ; 1 motor1 speed ; 2 motor2 round; 3 motor2 speed



Uart_t Uart1;
//Uart_t Uart2;
//Uart_t Uart3;

#define CONSOLE_UART &Uart1
#define IAP_UART &Uart1



void Uart_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	
	//USART1								  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
    										  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure); 

	Uart_Configuration (&Uart1, USART1, 57600, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No);
	
/*
	//USART2								  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
    										  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure); 
	
	Uart_Configuration (&Uart2, USART2, 57600, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No);

	//USART3								  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
    										  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOB, &GPIO_InitStructure); 
	
	Uart_Configuration (&Uart3, USART3, 57600, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No);
*/
	
	//swd
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);



}




#define MAX_FREQ 1000
#define LIMIT_MAX_SPEED 60 // round/min
#define LIMIT_MAX_FREQ 400 // LIMIT_MAX_SPEED / 60 *400
#define LIMIT_MIN_FREQ 1
#define ONE_ROUND_FREQ 400  //xi feng 
#define LIMIT_MAX_ROUND_COUNT 99
#define LIMIT_MIN_ROUND_COUNT 1
#define RATE_MAX_PULSE ONE_ROUND_FREQ // 用多少个pulse来做加减速
#define RATE_MIN_PULSE 0
#define RATE_FREQ 2
#define MOTOR_LOOP_INTERVAL_MS 10
#define MOTOR1_ID 1
#define MOTOR2_ID 2
#define MOTOR_DIRECTION_RIGHT Bit_SET
#define MOTOR_DIRECTION_LEFT Bit_RESET
#define MOTOR_EN_ON  Bit_RESET
#define MOTOR_EN_OFF Bit_SET

struct motor {
	unsigned short expect_speed;
	unsigned short expect_freq;
	unsigned short expect_circle_count;
	unsigned short current_freq;
	unsigned short current_circle_count;
	unsigned char direction;
	unsigned char id;
	unsigned int   current_pulse;
	unsigned int   expect_pulse;
	unsigned int   rate_reduce_pulse_point;
	unsigned int   rate_reduce_expect_freq;
	float          accelerate_freq;
	float					 accel;
	//pwm pin
	GPIO_TypeDef* pGPIOx;
	uint16_t pGPIO_pin;
	//pwm
	unsigned char channel;
	TIM_TypeDef* timer ;
	//dir pin
	GPIO_TypeDef* dGPIOx;
	uint16_t dGPIO_pin;
	//en pin
	GPIO_TypeDef* eGPIOx;
	uint16_t eGPIO_pin;
};

volatile struct motor motor1;
volatile struct motor motor2;
systick_time_t motor_timer;


void motor_set_direct(volatile struct motor *motorx , unsigned char direction) 
{
	GPIO_WriteBit( motorx->dGPIOx , motorx->dGPIO_pin, (BitAction) direction);
}

void motor_en(volatile struct motor *motorx , unsigned char en)
{
	GPIO_WriteBit( motorx->eGPIOx , motorx->eGPIO_pin, (BitAction) en);
}


int motor_rate(volatile struct motor *motorx, unsigned short freq)
{
	unsigned short period;
	GPIO_InitTypeDef GPIO_InitStructure;
	
	if( freq < LIMIT_MIN_FREQ ){
		// stop 
		TIM_Cmd(motorx->timer, DISABLE);
		#if 0
		GPIO_InitStructure.GPIO_Pin=motorx->pGPIO_pin;
		GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
		GPIO_Init(motorx->pGPIOx, &GPIO_InitStructure);
		GPIO_WriteBit(motorx->pGPIOx,motorx->pGPIO_pin, Bit_RESET);
		#endif
		//pwm_set( motorx->timer, motorx->channel, 0);
		_LOG("Motor%d set freq(%d)\n", motorx->id, freq);
		
	}else if( freq <= LIMIT_MAX_FREQ) {
		//set freq
		period = SystemCoreClock / (motorx->timer->PSC+1) / freq; 
		TIM_SetAutoreload( motorx->timer , period );
		pwm_set(motorx->timer , motorx->channel , 10);
		TIM_Cmd(motorx->timer, ENABLE);
		#if 0
		GPIO_InitStructure.GPIO_Pin=motorx->pGPIO_pin;
		GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP ;
		GPIO_Init(motorx->pGPIOx, &GPIO_InitStructure);
		#endif
		
		_LOG("Motor%d set freq(%d), start...\n", motorx->id, freq);
	}else{
		_LOG("Motor%d set freq(%d) error\n", motorx->id, freq); 
		return -1;
	}
	
	motorx->current_freq = freq;
	return 0;
}


void motor_hw_init(volatile struct motor *motorx)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	//pwm
	GPIO_InitStructure.GPIO_Pin=motorx->pGPIO_pin;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_AF_PP ;
	GPIO_Init(motorx->pGPIOx, &GPIO_InitStructure);
	//default pwm=0 , set freq at max  ; motor controler freq 0-200KHZ , limit at [0,1000] hz
	pwm_init(motorx->timer, motorx->channel, 20 ,  MAX_FREQ , 1 , 1); 
	TIM_ARRPreloadConfig( motorx->timer, ENABLE);
	switch( motorx->channel ){
	case 1:
		TIM_OC1PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	case 2:
		TIM_OC2PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	case 3:
		TIM_OC3PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	case 4:
		TIM_OC4PreloadConfig( motorx->timer, TIM_OCPreload_Enable);
		break;
	}

